backend/app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("user_id", "pet_id", "services", "location", "number_days", "fee") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["pet_id", 1], ["services", "Platinum"], ["location", "The Heigths"], ["number_days", 3], ["fee", 24]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
        booking = Booking.create({
            user_id: params[:user_id],
            pet_id: params[:pet_id],
            services: params[:services],
            fee: params[:fee],
            location: params[:location],
            number_days: params[:number_days]

        })
        user = User.find(params[:user_id])

SELECT "bookings".* FROM "bookings"
---
    def index
        bookings = Booking.all