backend/app/controllers/pets_controller.rb

INSERT INTO "pets" ("user_id", "name", "pet_type", "breed", "size") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["name", "Tood"], ["pet_type", "Cat"], ["breed", "Turkish"], ["size", "Large"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def create
        pet = Pet.create({
            user_id: params[:user_id],
            name: params[:name],
            pet_type: params[:pet_type],
            breed: params[:breed],
            size: params[:size]
        })
        user = User.find(params[:user_id])

SELECT "pets".* FROM "pets"
---
    def index
        pets = Pet.all