backend/app/controllers/reviews_controller.rb

    def create

        review = Review.create({
            user_id: params[:user_id],
            username: params[:username],
            text: params[:text],
            image: params[:image],

        })
---
INSERT INTO "reviews" ("user_id", "username", "text", "image") VALUES (?, ?, ?, ?)  [["user_id", 2], ["username", "Perro Loco"], ["text", "Esta bien pinche loco"], ["image", "https://pbs.twimg.com/profile_images/739870283524362241/Ah2ZefYl_400x400.jpg"]]