backend/app/controllers/users_controller.rb

    def create
        user = User.create({
            username: params[:username],
            password: params[:password],
            address: params[:address],
            email: params[:email]
        })
---
INSERT INTO "users" ("username", "password_digest", "address", "email") VALUES (?, ?, ?, ?)  [["username", "rata"], ["password_digest", "$2a$12$S3PSb6D2Vxo.iflpA.t83.qrBy1UtqqMyu9KTypdu4Wx0gehMsjlG"], ["address", "333"], ["email", "2222"]]